#+TITLE: Aprendizaje de Pesos en Características
#+SUBTITLE: Metaheurísticas: Práctica 3 @@latex: \\@@ Enfriamiento Simulado, Búsqueda Local Reiterada  y Evolución Diferencial@@latex: \\@@ Grupo 1 @@latex: \\@@M:17.30-19.30
#+LANGUAGE: es
#+AUTHOR: Luis Antonio Ortega Andrés @@latex: \\@@76425628D @@latex: \\@@ ludvins@correo.ugr.es
#+OPTIONS: toc:t num:2

#+latex_class_options: [oneside,openright,titlepage,numbers=noenddot,openany,headinclude,footinclude=true,cleardoublepage=empty,abstractoff,BCOR=5mm,paper=a4,fontsize=12pt,ngerman,american]
#+latex_header_extra: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+latex_header_extra: \usepackage{minted}
#+latex_header_extra: \usepackage[beramono,eulerchapternumbers,linedheaders,parts,a5paper,dottedtoc,manychapters]{classicthesis}
#+latex_header_extra: \input{setup}
#+latex_header_extra: \input{classicthesis-config}
#+latex_header: \input{macros}
\clearpage
*** 1-NN
 *Texture*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          93.636364 |              0 | 46.818182 |           1 |
| Partición 2 |          89.090910 |              0 | 44.545455 |           1 |
| Partición 3 |          94.545454 |              0 | 47.272727 |           1 |
| Partición 4 |          92.727274 |              0 | 46.363637 |           1 |
| Partición 5 |          92.727274 |              0 | 46.363637 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          92.545455 |              0 | 46.272728 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3) 

*Colposcopy*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |           74.57627 |              0 | 37.288135 |           0 |
| Partición 2 |           70.17544 |              0 | 35.087720 |           0 |
| Partición 3 |           73.68421 |              0 | 36.842105 |           0 |
| Partición 4 |           75.43859 |              0 | 37.719298 |           0 |
| Partición 5 |           82.45614 |              0 | 41.228070 |           0 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |           75.26613 |              0 | 37.633066 |           0 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

*Ionosphere*

|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          90.140843 |              0 | 45.070422 |           0 |
| Partición 2 |          80.000000 |              0 | 40.000000 |           0 |
| Partición 3 |          82.857144 |              0 | 41.428572 |           0 |
| Partición 4 |          92.857144 |              0 | 46.428572 |           0 |
| Partición 5 |          87.142855 |              0 | 43.571428 |           0 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          86.599597 |              0 | 43.299799 |           0 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

\clearpage
*** RELIEF descartando
*Texture*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          91.818184 |             15 | 53.409092 |           6 |
| Partición 2 |          91.818184 |            2.5 | 47.159092 |           6 |
| Partición 3 |          95.454544 |            2.5 | 48.977272 |           6 |
| Partición 4 |          92.727274 |            2.5 | 47.613637 |           6 |
| Partición 5 |          93.636364 |              5 | 49.318182 |           6 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          93.090910 |            5.5 | 49.295455 |           6 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)
*Colposcopy*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          72.881360 |      40.322580 | 56.601970 |           2 |
| Partición 2 |          75.438595 |      27.419356 | 51.428976 |           2 |
| Partición 3 |          77.192980 |      32.258064 | 54.725522 |           3 |
| Partición 4 |          71.929824 |      51.612900 | 61.771362 |           2 |
| Partición 5 |          82.456140 |      30.645162 | 56.550651 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          75.979780 |      36.451612 | 56.215696 |         2.2 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

*Ionosphere*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          90.140843 |      2.9411765 | 46.541010 |           2 |
| Partición 2 |          81.428572 |      2.9411765 | 42.184874 |           2 |
| Partición 3 |          82.857144 |      2.9411765 | 42.899160 |           2 |
| Partición 4 |          92.857140 |      2.9411765 | 47.899158 |           2 |
| Partición 5 |          90.000000 |      2.9411765 | 46.470588 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          87.456740 |      2.9411765 | 45.198958 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

\clearpage
*** RELIEF sin descartar
*Texture*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          93.636364 |             15 | 54.318182 |           6 |
| Partición 2 |          90.909094 |            2.5 | 46.704547 |           6 |
| Partición 3 |          95.454544 |            2.5 | 48.977272 |           6 |
| Partición 4 |          92.727274 |            2.5 | 47.613637 |           6 |
| Partición 5 |          93.636364 |              5 | 49.318182 |           6 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          93.272728 |            5.5 | 49.386364 |           6 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

*Colposcopy*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          72.881360 |      40.322580 | 56.601970 |           2 |
| Partición 2 |          71.929824 |      27.419356 | 49.674590 |           2 |
| Partición 3 |          78.947370 |      32.258064 | 55.602717 |           3 |
| Partición 4 |          73.684210 |      51.612900 | 62.648555 |           2 |
| Partición 5 |          84.210527 |      30.645162 | 57.427845 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          76.330658 |      36.451612 | 56.391135 |         2.2 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

*Ionosphere*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 1 |          90.140843 |      2.9411765 | 46.541010 |           2 |
| Partición 2 |          81.428572 |      2.9411765 | 42.184874 |           2 |
| Partición 3 |          82.857144 |      2.9411765 | 42.899160 |           2 |
| Partición 4 |          92.857140 |      2.9411765 | 47.899158 |           2 |
| Partición 5 |          90.000000 |      2.9411765 | 46.470588 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          87.456740 |      2.9411765 | 45.198958 |           2 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

\clearpage
*** Alternativa greedy
*Texture*
|-------------+--------------------+----------------+-----------+------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+------------|
| Partición 0 |          33.636364 |           97.5 | 65.568182 |          5 |
| Partición 1 |          36.363637 |           97.5 | 66.931819 |          5 |
| Partición 2 |          38.181818 |           97.5 | 67.840909 |          5 |
| Partición 3 |          40.000000 |           97.5 | 68.750000 |          5 |
| Partición 4 |          35.454544 |           97.5 | 66.522727 |          5 |
|-------------+--------------------+----------------+-----------+------------|
| Media       |          36.745455 |           97.5 | 67.122727 |          5 |
|-------------+--------------------+----------------+-----------+------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)
*Colposcopy*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 0 |          77.966100 |        98.3871 | 88.176600 |           1 |
| Partición 1 |          66.666667 |        98.3871 | 82.526884 |           1 |
| Partición 2 |          66.666667 |        98.3871 | 82.526884 |           1 |
| Partición 3 |          57.894737 |        98.3871 | 78.140919 |           1 |
| Partición 4 |          68.421054 |        98.3871 | 83.404077 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          67.523045 |        98.3871 | 82.955073 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

*Ionosphere*
|-------------+--------------------+----------------+-----------+-------------|
| Partición   | Tasa clasificación | Tasa reducción |  Agregado | Tiempo (ms) |
|-------------+--------------------+----------------+-----------+-------------|
| Partición 0 |          64.788735 |       97.05882 | 80.923778 |           1 |
| Partición 1 |          75.714284 |       97.05882 | 86.386552 |           1 |
| Partición 2 |          71.428573 |       97.05882 | 84.243697 |           1 |
| Partición 3 |          81.428570 |       97.05882 | 89.243695 |           1 |
| Partición 4 |          75.714284 |       97.05882 | 86.386552 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
| Media       |          73.814889 |       97.05882 | 85.436855 |           1 |
|-------------+--------------------+----------------+-----------+-------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)

\clearpage
*** Búsqueda local
*Texture*

|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |   87.27273 |        85 | 86.136365 |       12579 |         60 |
| Partición 1 |   87.27273 |      82.5 | 84.886365 |       13432 |         59 |
| Partición 2 |   89.09091 |      87.5 | 88.295455 |       24891 |         62 |
| Partición 3 |   84.54546 |      82.5 | 83.522730 |       15794 |         67 |
| Partición 4 |   83.63636 |      82.5 | 83.068180 |       20386 |         69 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |  86.363638 |      84.0 | 85.181819 |     17416.4 |       63.4 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)


*Colposcopy*


|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |   76.27119 |  75.80645 |  76.03882 |        7487 |         75 |
| Partición 1 |   75.43859 |  83.87096 |  79.65478 |        6097 |         64 |
| Partición 2 |   78.94737 |  69.35484 |  74.15110 |        9439 |         63 |
| Partición 3 |   71.92982 |  74.19355 |  73.06168 |       11751 |         59 |
| Partición 4 |   73.68421 |  85.48387 |  79.58404 |       12121 |         63 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |   75.25423 | 77.741935 | 76.498086 |        9379 |       64.8 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)


*Ionosphere*
|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |  92.957747 |  88.23529 | 90.596521 |        4927 |         59 |
| Partición 1 |  74.285716 |  91.17647 | 82.731093 |        3103 |         48 |
| Partición 2 |  85.714287 |  91.17647 | 88.445379 |        2934 |         42 |
| Partición 3 |  87.142855 |  85.29411 | 86.218486 |        3961 |         54 |
| Partición 4 |  88.571430 |  82.35294 | 85.462185 |        2948 |         33 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |  85.734407 | 87.647058 | 86.690733 |      3574.6 |       47.2 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)


\clearpage
*** Búsqueda local con vector inicial de RELIEF
*Texture*

|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |   89.09091 |      82.5 |  85.79545 |        7948 |         44 |
| Partición 1 |   90.00000 |        85 |  87.50000 |       10993 |         63 |
| Partición 2 |   93.63636 |      87.5 |  90.56818 |       14406 |         70 |
| Partición 3 |   84.54546 |      87.5 |  86.02273 |       10536 |         50 |
| Partición 4 |   87.27273 |        85 |  86.13636 |       10248 |         56 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |   88.90909 |      85.5 | 87.204546 |     10826.2 |       56.6 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*

|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |   74.57627 |  80.64516 | 77.610715 |        5823 |         57 |
| Partición 1 |   80.70175 |  83.87096 | 82.286361 |        7318 |         64 |
| Partición 2 |   78.94737 |  85.48387 | 82.215620 |       11034 |         67 |
| Partición 3 |   73.68421 |  88.70967 | 81.196943 |        4243 |         38 |
| Partición 4 |   71.92982 |  83.87096 | 77.900395 |        6406 |         70 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |   75.96788 |  84.51612 | 80.242007 |      6964.8 |       59.2 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*

|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |   80.28169 | 88.235295 | 84.258493 |        4384 |         67 |
| Partición 1 |   81.42857 | 85.294116 | 83.361343 |        4025 |         52 |
| Partición 2 |   84.28571 | 91.176470 | 87.731090 |        4501 |         68 |
| Partición 3 |   91.42857 | 88.235295 | 89.831933 |        8425 |         71 |
| Partición 4 |   88.57143 | 82.352940 | 85.462185 |        4428 |         55 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |   85.19919 | 87.058823 | 86.129009 |      5152.6 |       62.6 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Búsqueda local con vector inicial de greedy.
*Texture*
|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |  90.909094 |        85 | 87.954547 |        9321 |         15 |
| Partición 1 |  88.181820 |        85 | 86.590910 |       10303 |         22 |
| Partición 2 |  95.454544 |        85 | 90.227272 |        5142 |         14 |
| Partición 3 |  91.818184 |        85 | 88.409092 |        7802 |         18 |
| Partición 4 |  86.363630 |        85 | 85.681815 |        6105 |          8 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |  90.545454 |        85 | 87.772727 |      7734.6 |       15.4 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |  81.355930 |  95.16129 | 88.258610 |        3227 |          2 |
| Partición 1 |  66.666670 |  90.32258 | 78.494625 |        8461 |         12 |
| Partición 2 |  75.438595 |  95.16129 | 85.299943 |        3670 |          5 |
| Partición 3 |  71.929824 |  93.54839 | 82.739107 |        6485 |         12 |
| Partición 4 |  70.175440 |  91.93548 | 81.055460 |        5242 |         13 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |  73.113292 |  93.22580 | 83.169549 |        5417 |        8.8 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+------------+-----------+-----------+-------------+------------|
| Partición   | Tasa clas. | Tasa red. |  Agregado | Tiempo (ms) | Mutaciones |
|-------------+------------+-----------+-----------+-------------+------------|
| Partición 0 |  91.549295 |  88.23529 | 89.892295 |        2195 |        5 5 |
| Partición 1 |  80.000000 |  91.17647 | 85.588235 |        1903 |          8 |
| Partición 2 |  91.428570 |  91.17647 | 91.302520 |        3356 |         11 |
| Partición 3 |  90.000000 |  88.23529 | 89.117648 |        1954 |          6 |
| Partición 4 |  82.857114 |  91.17647 | 87.016792 |        2305 |          8 |
|-------------+------------+-----------+-----------+-------------+------------|
| Media       |  87.166996 |  90.00000 | 88.583498 |      2342.6 |       11.6 |
|-------------+------------+-----------+-----------+-------------+------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo genético generacional con cruce aritmético.
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             90.000000 |         80.000000 | 85.000000 |       98248 |
| Partición 1 |             89.090910 |         67.500000 | 78.295455 |      105582 |
| Partición 2 |             92.727274 |         70.000000 | 81.363637 |      101701 |
| Partición 3 |             89.090910 |         77.500000 | 83.295455 |      103449 |
| Partición 4 |             92.727274 |         77.500000 | 85.113637 |      101813 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.727274 |              74.5 | 82.613637 |    102158.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |              74.57627 |         59.677420 | 67.126845 |       44335 |
| Partición 1 |              70.17544 |         62.903225 | 66.539333 |       45499 |
| Partición 2 |              77.19298 |         58.064514 | 67.628747 |       48600 |
| Partición 3 |              73.68421 |         64.516103 | 69.100157 |       47317 |
| Partición 4 |              78.94737 |         58.064514 | 68.505942 |       44717 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             74.915254 |         60.645155 | 67.780205 |     46093.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*

|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             81.690140 |         82.352940 |  82.02154 |       34761 |
| Partición 1 |             81.428570 |         73.529410 |  77.47899 |       36104 |
| Partición 2 |             87.142855 |         64.705884 | 75.924370 |       45563 |
| Partición 3 |             90.000000 |         73.529410 | 81.764705 |       36090 |
| Partición 4 |             92.857140 |         76.470590 | 84.663865 |       37077 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             86.623741 |         74.117647 | 80.370694 |       37919 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo genético generacional con cruce BLX.
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             90.909094 |              87.5 | 89.204547 |       92083 |
| Partición 1 |             92.727274 |              85.0 | 88.863637 |       97394 |
| Partición 2 |             90.909094 |              77.5 | 84.204547 |      101117 |
| Partición 3 |             86.363640 |              82.5 | 84.431820 |       99005 |
| Partición 4 |             92.727274 |              82.5 | 87.613637 |       93546 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.727275 |              83.0 | 86.863638 |       96629 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             77.966100 |          75.80645 | 76.886275 |       39326 |
| Partición 1 |             80.701756 |          72.58065 | 76.641203 |       40180 |
| Partición 2 |             71.929824 |          72.58065 | 72.255237 |       41990 |
| Partición 3 |             68.421054 |          77.41935 | 72.920202 |       38860 |
| Partición 4 |             73.684210 |          77.41935 | 75.551780 |       44683 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             74.540589 |          75.16129 | 74.850939 |     41007.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             90.140843 |         88.235295 | 89.188069 |       33884 |
| Partición 1 |             87.142855 |         88.235295 | 87.689075 |       31525 |
| Partición 2 |             85.714287 |         88.235295 | 86.974791 |       32595 |
| Partición 3 |             94.285715 |         91.176470 | 92.731093 |       32796 |
| Partición 4 |             88.571430 |         85.294116 | 86.932773 |       33914 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.171026 |         88.235294 | 88.703160 |     32942.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage
*** Algoritmo genético estacionario con cruce aritmético.
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |              84.54546 |              85.0 | 84.772730 |       95803 |
| Partición 1 |              87.27273 |              70.0 | 78.636365 |      110003 |
| Partición 2 |              87.27273 |              72.5 | 79.886365 |      111586 |
| Partición 3 |              85.45455 |              77.5 | 81.477275 |      106585 |
| Partición 4 |              84.54546 |              82.5 | 83.522730 |       98446 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |              85.81818 |              77.5 | 81.659093 |    104484.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy* 

|-------------+-----------------------+-------------------+-----------+--------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo  (ms) |
|-------------+-----------------------+-------------------+-----------+--------------|
| Partición 0 |             76.271190 |         59.677429 | 67.974310 |        44600 |
| Partición 1 |             75.438595 |         61.290324 | 68.364460 |        44005 |
| Partición 2 |             66.666670 |         66.129035 | 66.397853 |        43702 |
| Partición 3 |             64.912283 |         67.741936 | 66.327110 |        43759 |
| Partición 4 |             78.947370 |         64.516130 | 71.731750 |        43835 |
|-------------+-----------------------+-------------------+-----------+--------------|
| Media       |             72.447222 |         63.870971 | 68.159097 |      43980.2 |
|-------------+-----------------------+-------------------+-----------+--------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere* 
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             87.323946 |         64.705884 | 76.014915 |       37402 |
| Partición 1 |             85.714287 |         58.823530 | 72.268909 |       36564 |
| Partición 2 |             87.142855 |         70.588240 | 78.865548 |       35552 |
| Partición 3 |             91.428570 |         82.352940 | 86.890755 |       33691 |
| Partición 4 |             88.571430 |         79.411760 | 83.991595 |       35665 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             88.036218 |         71.176471 | 79.606344 |     35774.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo genético estacionario con cruce BLX.
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |              90.00000 |              77.5 |  83.75000 |       99536 |
| Partición 1 |              89.09091 |              82.5 |  85.79545 |       89095 |
| Partición 2 |              91.81818 |              77.5 |  84.65909 |       93316 |
| Partición 3 |              89.09091 |              82.5 |  85.79545 |       93924 |
| Partición 4 |              88.18182 |              82.5 |  85.34091 |       97261 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.636364 |              80.5 | 85.068182 |     94626.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             69.491524 |         67.741936 | 68.616739 |       41245 |
| Partición 1 |             71.929824 |         75.806450 | 73.868137 |       41433 |
| Partición 2 |             77.192980 |         72.580650 | 74.886815 |       41987 |
| Partición 3 |             75.438595 |         69.354840 | 72.396718 |       42027 |
| Partición 4 |             78.947370 |         66.129035 | 72.538203 |       43901 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             74.600059 |         70.322582 | 72.461321 |     42118.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             92.957747 |         85.294116 | 89.125932 |       31042 |
| Partición 1 |             87.142855 |         85.294116 | 86.218486 |       30797 |
| Partición 2 |             87.142855 |         82.352940 | 84.747898 |       31681 |
| Partición 3 |             92.857140 |         67.647060 | 80.252100 |       34877 |
| Partición 4 |             90.000000 |         88.235295 | 89.117648 |       30125 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.020119 |         81.764705 | 85.892413 |     31704.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo memético 1
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |              90.00000 |              85.0 | 87.500000 |       88018 |
| Partición 1 |              85.45455 |              85.0 | 85.227275 |       89085 |
| Partición 2 |              90.00000 |              87.5 | 88.750000 |       88598 |
| Partición 3 |              88.18182 |              87.5 | 87.840910 |       87827 |
| Partición 4 |              87.27273 |              85.0 | 86.136365 |       87771 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |              88.18182 |              86.0 |  87.09091 |     88259.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             77.966100 |         80.645160 | 79.305630 |       39342 |
| Partición 1 |             68.421054 |         82.258064 | 75.339559 |       40581 |
| Partición 2 |             71.929824 |         82.258064 | 77.093944 |       38556 |
| Partición 3 |             68.421054 |         75.806450 | 72.113752 |       39884 |
| Partición 4 |             71.929824 |         87.096775 | 79.513300 |       37742 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             71.733571 |         81.612903 | 76.673237 |       39221 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             85.915494 |         91.176470 | 88.545982 |       29843 |
| Partición 1 |             85.714287 |         91.176470 | 88.445379 |       30881 |
| Partición 2 |             82.857144 |         85.294116 | 84.075630 |       31252 |
| Partición 3 |             85.714287 |         94.117650 | 89.915969 |       31921 |
| Partición 4 |             81.428570 |         85.294116 | 83.361343 |       30932 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             84.325956 |         89.411764 | 86.868861 |     30965.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo memético 1 con pesos iniciales retocados.
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             89.090910 |              87.5 | 88.295455 |       86398 |
| Partición 1 |             92.727274 |              85.0 | 88.863637 |       88002 |
| Partición 2 |             88.181820 |              85.0 | 86.590910 |       88565 |
| Partición 3 |             89.090910 |              87.5 | 88.295455 |       87628 |
| Partición 4 |             92.727274 |              87.5 | 90.113637 |       85799 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.363638 |              86.5 | 88.431819 |     87278.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             61.016950 |          93.54839 | 77.282670 |       37577 |
| Partición 1 |             77.192980 |          93.54839 | 85.370685 |       38801 |
| Partición 2 |             71.929824 |          95.16129 | 83.545557 |       36384 |
| Partición 3 |             78.947370 |          93.54839 | 86.247880 |       37565 |
| Partición 4 |             68.421054 |          90.32258 | 79.371817 |       34199 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             71.501636 |         93.225808 | 82.363722 |     36905.2 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             84.507040 |         91.176470 | 87.841755 |       29170 |
| Partición 1 |             78.571427 |         91.176470 | 84.873949 |       30449 |
| Partición 2 |             84.285710 |         91.176470 | 87.731090 |       28998 |
| Partición 3 |             94.285715 |         88.235295 | 91.260505 |       29440 |
| Partición 4 |             82.857144 |         91.176470 | 87.016807 |       31771 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             84.901407 |         90.588235 | 87.744821 |     29965.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage
*** Algoritmo memético 2
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             86.363640 |              87.5 | 86.931820 |       82119 |
| Partición 1 |             91.818184 |              85.0 | 88.409092 |       83517 |
| Partición 2 |             90.909094 |              80.0 | 85.454547 |       87325 |
| Partición 3 |             85.454550 |              87.5 | 86.477275 |       85724 |
| Partición 4 |             89.090910 |              87.5 | 88.295455 |       84351 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             88.727276 |              85.5 | 87.113638 |     84607.2 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             72.881360 |         80.645160 | 76.763260 |       36203 |
| Partición 1 |             75.438595 |         83.870965 | 79.654780 |       36975 |
| Partición 2 |             70.175440 |         80.645160 | 75.410300 |       37098 |
| Partición 3 |             75.438595 |         87.096775 | 81.267685 |       35388 |
| Partición 4 |             80.701756 |         79.032260 | 79.867008 |       39430 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             74.927149 |         82.258064 | 78.592607 |     37018.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             87.323946 |         91.176470 | 89.250208 |       28337 |
| Partición 1 |             84.285710 |         88.235295 | 86.260503 |       32157 |
| Partición 2 |             85.714287 |         88.235295 | 86.974791 |       28655 |
| Partición 3 |             90.000000 |         88.235295 | 89.117648 |       29336 |
| Partición 4 |             88.571430 |         88.235295 | 88.403363 |       29093 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             87.179075 |          88.82353 | 88.001303 |     29515.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Algoritmo memético 3
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             86.363640 |              85.0 | 85.681820 |       86035 |
| Partición 1 |             93.636364 |              85.0 | 89.318182 |       83503 |
| Partición 2 |             89.090910 |              85.0 | 87.045455 |       82768 |
| Partición 3 |             88.181820 |              85.0 | 86.590910 |       85647 |
| Partición 4 |             94.545454 |              87.5 | 91.022727 |       82129 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.363638 |              85.5 | 87.931819 |     84016.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             77.966100 |         87.096775 | 82.531438 |       34015 |
| Partición 1 |             73.684210 |         85.483870 | 79.584040 |       36246 |
| Partición 2 |             80.701756 |         82.258064 | 81.479910 |       36135 |
| Partición 3 |             78.947370 |         85.483870 | 82.215620 |       37334 |
| Partición 4 |             75.438595 |         83.870965 | 79.654780 |       36268 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             77.347606 |         84.838709 | 81.093158 |     35999.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmea wdn(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             85.915494 |         85.294116 | 85.604805 |       29627 |
| Partición 1 |             84.285710 |         85.294116 | 84.789913 |       30035 |
| Partición 2 |             85.714287 |         88.235295 | 86.974791 |       33477 |
| Partición 3 |             94.285715 |         91.176470 | 92.731093 |       34594 |
| Partición 4 |             82.857144 |         94.117650 | 88.487397 |       33916 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |              86.61167 |         88.823529 | 87.717600 |     32329.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage
*** Algoritmo memético 3 con pesos iniciales retocados
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             90.909094 |              87.5 | 89.204547 |       81846 |
| Partición 1 |             92.727274 |              87.5 | 90.113637 |       82093 |
| Partición 2 |             88.181820 |              87.5 | 87.840910 |       80126 |
| Partición 3 |             87.272730 |              87.5 | 87.386365 |       81643 |
| Partición 4 |             87.272730 |              85.0 | 86.136365 |       83795 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.272730 |              87.0 | 88.136365 |     81900.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             74.576270 |         95.161290 | 84.868780 |       35961 |
| Partición 1 |             70.175440 |         91.935486 | 81.055463 |       35307 |
| Partición 2 |             73.684210 |         91.935486 | 82.809848 |       37517 |
| Partición 3 |             75.438595 |         90.322580 | 82.880588 |       36316 |
| Partición 4 |             73.684210 |         88.709676 | 81.196943 |       33586 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             73.511745 |         91.612904 | 82.562324 |     35737.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             80.281690 |         91.176470 |  85.72908 |       28318 |
| Partición 1 |             81.428570 |         91.176470 |  86.30252 |       28082 |
| Partición 2 |             82.857144 |         88.235295 | 85.546220 |       28534 |
| Partición 3 |             95.714283 |         91.176470 | 93.445377 |       28006 |
| Partición 4 |             87.142855 |         91.176470 | 89.159663 |       35068 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             85.484908 |         90.588235 | 88.036572 |     29601.6 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage
*** Enfriamiento Simulado
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             90.000000 |              87.5 | 88.750000 |       81039 |
| Partición 1 |             88.181820 |              87.5 | 87.840910 |       82668 |
| Partición 2 |             90.000000 |              87.5 | 88.750000 |       83469 |
| Partición 3 |             89.090910 |              87.5 | 88.295455 |       82597 |
| Partición 4 |             90.909094 |              85.0 | 87.954547 |       83268 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.636365 |              87.0 | 88.318182 |     82608.2 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             74.576270 |         90.322580 | 82.449425 |       38279 |
| Partición 1 |             70.175440 |         87.096775 | 78.636108 |       44575 |
| Partición 2 |             68.421054 |         83.870965 | 76.146010 |       40638 |
| Partición 3 |             71.929824 |         88.709676 | 80.319750 |       44362 |
| Partición 4 |             75.438595 |         87.096775 | 81.267685 |       41976 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             72.108237 |         87.419354 | 79.763796 |       41966 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             88.732390 |         91.176470 | 89.954430 |       24864 |
| Partición 1 |             81.428570 |         88.235295 | 84.831933 |       27357 |
| Partición 2 |             87.142855 |         91.176470 | 89.159663 |       26891 |
| Partición 3 |             94.285715 |         88.235295 | 91.260505 |       25478 |
| Partición 4 |             90.000000 |         88.235295 | 89.117648 |       28250 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             88.317906 |         89.411765 | 88.864836 |       26568 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage
*** Enfriamiento Simulado (Pesos iniciales RELIEF)
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             91.818184 |              87.5 | 89.659092 |       61500 |
| Partición 1 |             90.000000 |              87.5 | 88.750000 |       88159 |
| Partición 2 |             90.909094 |              87.5 | 89.204547 |       89628 |
| Partición 3 |             91.818184 |              87.5 | 89.659092 |       85302 |
| Partición 4 |             88.181820 |              85.0 | 86.590910 |       86951 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             90.545456 |              87.0 | 88.772728 |       82308 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             72.881360 |         88.709676 | 80.795518 |       33070 |
| Partición 1 |             64.912283 |         90.322580 | 77.617432 |       32532 |
| Partición 2 |             75.438595 |         85.483870 | 80.461233 |       37530 |
| Partición 3 |             70.175440 |         88.709676 | 79.442558 |       37353 |
| Partición 4 |             78.947370 |         88.709676 | 83.828523 |       43434 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             72.471010 |         88.387096 | 80.429053 |     36783.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             85.915494 |         88.235295 | 87.075395 |       28002 |
| Partición 1 |             90.000000 |         91.176470 | 90.588235 |       26741 |
| Partición 2 |             85.714287 |         88.235295 | 86.974791 |       26998 |
| Partición 3 |             87.142855 |         91.176470 | 89.159663 |       33129 |
| Partición 4 |             87.142855 |         91.176470 | 89.159663 |       24669 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             87.183098 |         90.000000 | 88.591549 |     27907.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage

*** Iterative Local Search
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             87.272730 |              85.0 | 86.136365 |       86745 |
| Partición 1 |             88.181820 |              87.5 | 87.840910 |       86350 |
| Partición 2 |             87.272727 |              87.5 | 87.386364 |       90772 |
| Partición 3 |             90.909094 |              87.5 | 89.204547 |       88256 |
| Partición 4 |             90.000000 |              87.5 | 88.750000 |       88302 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             88.727274 |              87.0 | 87.863637 |       88085 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             76.271190 |         83.870965 | 80.071078 |       36873 |
| Partición 1 |             73.684210 |         85.483870 | 79.584040 |       42682 |
| Partición 2 |             73.684210 |         88.709676 | 81.196943 |       41835 |
| Partición 3 |             71.929824 |         80.645160 | 76.287492 |       48716 |
| Partición 4 |             77.192980 |         83.870965 | 80.531973 |       42500 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             74.552483 |         84.516127 | 79.534305 |     42521.2 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             85.915494 |         91.176470 | 88.545982 |       25526 |
| Partición 1 |             82.857144 |         91.176470 | 87.016807 |       27449 |
| Partición 2 |             84.285710 |         88.235295 | 86.260503 |       25751 |
| Partición 3 |             95.714283 |         88.235295 | 91.974789 |       27057 |
| Partición 4 |             87.142855 |         91.176470 | 89.159663 |       28079 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             87.183097 |         90.000000 | 88.591549 |     26772.4 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

\clearpage

*** Iterative Local Search (Pesos iniciales Greedy)
*Texture*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             87.272730 |              87.5 | 87.386365 |       75447 |
| Partición 1 |             88.181820 |              87.5 |  87.84091 |       75491 |
| Partición 2 |             91.818184 |              87.5 | 89.659092 |       77344 |
| Partición 3 |             90.909094 |              87.5 | 89.204547 |       73853 |
| Partición 4 |             90.000000 |              85.0 |      87.5 |       77444 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.636366 |               87. | 88.318183 |     75915.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             72.881360 |          93.54839 | 83.214875 |       34803 |
| Partición 1 |             70.175440 |          93.54839 | 81.861915 |       32902 |
| Partición 2 |             70.175440 |          93.54839 | 81.861915 |       34909 |
| Partición 3 |             75.438595 |          90.32258 | 82.880588 |       33666 |
| Partición 4 |             75.438595 |          90.32258 | 82.880588 |       32815 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             72.821886 |         92.258066 | 82.539976 |       33819 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición   | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-------------+-----------------------+-------------------+-----------+-------------|
| Partición 0 |             92.957747 |         88.235295 | 90.596521 |       23411 |
| Partición 1 |             90.000000 |         91.176470 | 90.588235 |       21515 |
| Partición 2 |             90.000000 |         91.176470 | 90.588235 |       24973 |
| Partición 3 |             91.428570 |         91.176470 | 91.302520 |       22021 |
| Partición 4 |             82.857144 |         91.176470 | 87.016807 |       21544 |
|-------------+-----------------------+-------------------+-----------+-------------|
| Media       |             89.448692 |         90.588235 | 90.018464 |     22692.8 |
|-------------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage

*** Evolución Diferencial 1
*Texture*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             91.818184 |              87.5 | 89.659092 |       84478 |
|         1 |             89.090904 |              87.5 | 88.295452 |       87985 |
|         2 |              96.36363 |              87.5 | 91.931815 |       84988 |
|         3 |              86.36364 |              87.5 |  86.93182 |       86318 |
|         4 |              93.63636 |              87.5 |  90.56818 |       85593 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             91.454544 |              87.5 | 89.477272 |     85872.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             67.796616 |         93.548386 | 80.672501 |       39170 |
|         1 |              73.68421 |         95.161285 | 84.422748 |       38277 |
|         2 |              80.70176 |         93.548386 | 87.125073 |       38282 |
|         3 |              73.68421 |         93.548386 | 83.616298 |       38567 |
|         4 |             71.929825 |         95.161285 | 83.545555 |       37567 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             73.559324 |         94.193546 | 83.876435 |     38372.6 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |              88.73239 |          91.17647 |  89.95443 |       29150 |
|         1 |                    80 |          91.17647 | 85.588235 |       33259 |
|         2 |              82.85715 |          91.17647 |  87.01681 |       30672 |
|         3 |              95.71428 |          91.17647 | 93.445375 |       30090 |
|         4 |              82.85715 |          91.17647 |  87.01681 |       29305 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             86.032194 |          91.17647 | 88.604332 |     30495.2 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage
*** Evolución Diferencial 2
*Texture*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             90.000000 |              85.0 | 87.500000 |       84254 |
|         1 |             86.363640 |              67.5 | 76.931820 |       93324 |
|         2 |             95.454544 |              80.0 | 87.727272 |       91918 |
|         3 |             90.000000 |              80.0 | 85.000000 |       88850 |
|         4 |             86.363640 |              82.5 | 84.431820 |       86251 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             89.636365 |              79.0 | 84.318182 |     88919.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             76.271190 |         77.419350 | 76.845270 |       37297 |
|         1 |             64.912285 |         67.741936 | 66.327111 |       39354 |
|         2 |             70.175440 |         79.032260 | 74.603850 |       38267 |
|         3 |             77.192980 |         66.129036 | 71.661008 |       40284 |
|         4 |             78.947370 |         72.580650 | 75.764010 |       39160 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             73.499853 |         72.580646 | 73.040250 |     38872.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             94.366196 |          85.29411 | 89.830153 |       29210 |
|         1 |             85.714290 |          88.23530 | 86.974795 |       29075 |
|         2 |             80.000000 |          85.29411 | 82.647055 |       29662 |
|         3 |             91.428570 |          85.29411 | 88.361340 |       29877 |
|         4 |             92.857140 |          82.35294 | 87.605040 |       35558 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             88.873239 |         85.294114 | 87.083677 |     30676.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage

*** Evolución Diferencial 2 F = 1.0
*Texture*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             90.000000 |              87.5 | 88.750000 |      127358 |
|         1 |             91.818184 |              87.5 | 89.659092 |      112729 |
|         2 |             94.545456 |              87.5 | 91.022728 |      113849 |
|         3 |             88.181816 |              87.5 | 87.840908 |      116772 |
|         4 |             90.000000 |              87.5 | 88.750000 |       92611 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             90.909091 |              87.5 | 89.204546 |    112663.8 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             72.881355 |         91.935486 | 82.408421 |       35235 |
|         1 |             71.929825 |         87.096770 | 79.513298 |       36646 |
|         2 |             61.403507 |         90.322580 | 75.863044 |       37674 |
|         3 |             70.175440 |         91.935486 | 81.055463 |       38194 |
|         4 |             71.929825 |         95.161285 | 83.545555 |       37163 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             69.663990 |         91.290321 | 80.477156 |     36982.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |              88.73239 |          91.17647 | 89.954430 |       28543 |
|         1 |              78.57143 |          91.17647 | 84.873950 |       30033 |
|         2 |              90.00000 |          91.17647 | 90.588235 |       29327 |
|         3 |              90.00000 |          88.23530 | 89.117650 |       29380 |
|         4 |              85.71429 |          91.17647 | 88.445380 |       32329 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             86.603622 |         90.588236 | 88.595929 |     29922.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage

*** Evolución Diferencial 2 (Pesos iniciales de  RELIEF)
*Texture*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             88.181816 |              85.0 | 86.590908 |       82416 |
|         1 |             88.181816 |              87.5 | 87.840908 |       87006 |
|         2 |             92.727270 |              85.0 | 88.863635 |       85753 |
|         3 |             87.272730 |              87.5 | 87.386365 |       89048 |
|         4 |             89.090904 |              87.5 | 88.295452 |       82813 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             89.090907 |              86.5 | 87.795454 |     85407.2 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Colposcopy*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             69.491520 |         93.548386 | 81.519953 |       36490 |
|         1 |             66.666670 |         93.548386 | 80.107528 |       37465 |
|         2 |             70.175440 |         95.161285 | 82.668363 |       35676 |
|         3 |             66.666670 |         93.548386 | 80.107528 |       34556 |
|         4 |             71.929825 |         93.548386 | 82.739106 |       38325 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             68.986025 |         93.870966 | 81.428496 |     36502.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)

*Ionosphere*
|-----------+-----------------------+-------------------+-----------+-------------|
| Partición | Tasa de clasificación | Tasa de reducción |  Agregado | Tiempo (ms) |
|-----------+-----------------------+-------------------+-----------+-------------|
|         0 |             90.140850 |         91.176470 | 90.658660 |       28442 |
|         1 |             82.857150 |         91.176470 | 87.016810 |       34111 |
|         2 |             82.857150 |         91.176470 | 87.016810 |       28489 |
|         3 |             94.285710 |         94.117645 | 94.201678 |       31317 |
|         4 |             81.428566 |         91.176470 | 86.302518 |       28948 |
|-----------+-----------------------+-------------------+-----------+-------------|
|     Media |             86.313885 |         91.764705 | 89.039295 |     30261.4 |
|-----------+-----------------------+-------------------+-----------+-------------|
#+TBLFM: @7$6=vmean(@2..@6)::@2$4=vmean($2..$3)::@3$4=vmean($2..$3)::@4$4=vmean($2..$3)::@5$4=vmean($2..$3)::@6$4=vmean($2..$3)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@7$5=vmean(@2..@6)
\clearpage

